scripts/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 20
      name: Ramp up
    - duration: 120
      arrivalRate: 50
      name: Sustained load
    - duration: 60
      arrivalRate: 100
      name: Peak load
    - duration: 30
      arrivalRate: 10
      name: Cool down
  processor: './load-test-processor.js'

scenarios:
  - name: Track single event
    weight: 70
    flow:
      - post:
          url: '/api/events/track'
          headers:
            X-API-Key: '{{ $processEnvironment.API_KEY }}'
            Content-Type: 'application/json'
          json:
            eventType: '{{ eventType }}'
            userId: 'user_{{ $randomNumber() }}'
            sessionId: 'session_{{ $randomNumber() }}'
            url: 'https://example.com/page{{ $randomNumber() }}'
            referrer: 'https://google.com'
            screenWidth: 1920
            screenHeight: 1080
            metadata:
              test: true
              timestamp: '{{ $timestamp }}'

  - name: Track batch events
    weight: 20
    flow:
      - post:
          url: '/api/events/track/batch'
          headers:
            X-API-Key: '{{ $processEnvironment.API_KEY }}'
            Content-Type: 'application/json'
          json:
            events: '{{ batchEvents }}'

  - name: Query analytics
    weight: 10
    flow:
      - get:
          url: '/api/analytics/events/summary?appId={{ $processEnvironment.APP_ID }}'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.JWT_TOKEN }}'